name: "RFML_NET"
layer {
  name: "rfml"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/boston/data_gen/rfml_db/rfml_train_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "rfml"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/boston/data_gen/rfml_db/rfml_train_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 256
    kernel_h: 1
    kernel_w: 3
    weight_filler {
     type: "xavier"
    }
    pad_w: 2
    pad_h: 0
  }
}
layer{
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer{
  name: "dropout1"
  type: "Dropout"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  convolution_param {
    num_output: 80
    kernel_h: 2
    kernel_w: 3
    weight_filler {
        type: "gaussian" # initialize the filters from a Gaussian
        std: 0.01        # distribution with stdev 0.01 (default mean: 0)
	}
    pad_h: 0
    pad_w: 2
  }
}
layer{
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer{
  name: "dropout2"
  type: "Dropout"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "flatten1"
  type: "Flatten"
  top: "flatten1"
  bottom: "conv2"
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "flatten1"
  top: "ip1"
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer{
  name: "dropout3"
  type: "Dropout"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  inner_product_param {
    num_output: 11
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
